### Common Formulae
brew "age" unless which("age", ORIGINAL_PATHS)
brew "atuin" unless which("atuin", ORIGINAL_PATHS)
brew "bat"
brew "bottom"
brew "cargo-binstall" if which("cargo", ORIGINAL_PATHS)
brew "chezmoi" unless which("chezmoi", ORIGINAL_PATHS)
brew "dasel"
brew "difftastic"
brew "dua-cli"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-absorb"
brew "git-branchless"
brew "git-delta"
brew "htop"
brew "jj"
brew "jq"
brew "just"
brew "lnav"
brew "mas"
brew "mise" unless which("mise", ORIGINAL_PATHS)
brew "ninja"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "usage"
brew "watchman"
brew "yt-dlp"
brew "zellij"
brew "zoxide"

# macOS Formulae
brew "curl" if OS.mac?
brew "gpg" if OS.mac?
brew "neovim" if OS.mac?
brew "rsync" if OS.mac?
brew "telnet" if OS.mac?
brew "wget" if OS.mac?
cask "font-intel-one-mono" if OS.mac?
cask "font-intone-mono-nerd-font" if OS.mac?

# Linuxbrew

# Mac App Store
mas "1Password for Safari", id: 1569813296 if OS.mac?
# mas "Amphetamine", id: 937984704 if OS.mac?
# mas "DaisyDisk", id: 411643860 if OS.mac?
mas "Fantastical", id: 975937182 if OS.mac?
# mas "Gapplin", id: 768053424 if OS.mac?
mas "Gifski", id: 1351639930 if OS.mac?
mas "GoodLinks", id: 1474335294 if OS.mac?
# mas "Hand Mirror", id: 1502839586 if OS.mac?
mas "Hyperduck", id: 6444667067 if OS.mac?
# mas "iMovie", id: 408981434 if OS.mac?
mas "Keep It", id: 1272768911 if OS.mac?
# mas "Keynote", id: 409183694 if OS.mac?
# mas "MusicBox", id: 1614730313 if OS.mac?
# mas "MusicHarbor", id: 1440405750 if OS.mac?
# mas "Numbers", id: 409203825 if OS.mac?
# mas "Pages", id: 409201541 if OS.mac?
mas "Photomator", id: 1444636541 if OS.mac?
mas "Pixelmator Pro", id: 1289583905 if OS.mac?
mas "Refined GitHub", id: 1519867270 if OS.mac?
mas "Silicio", id: 933627574 if OS.mac?
# mas "TestFlight", id: 899247664 if OS.mac?
mas "Todoist", id: 585829637 if OS.mac?
mas "Xcode", id: 497799835 if OS.mac?
mas "Yoink", id: 457622435 if OS.mac?
